# Python Package : Pandas  --> In Progress

In [1]:
#Importing Packages
import numpy as np
import pandas as pd
import os

#### Pandas Seies

#### More about pandas series here 
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html?highlight=series#pandas.Series <b>

https://www.youtube.com/watch?v=UB3DE5Bgfx4

In [2]:
#creating a pandas serires
pds = pd.Series([1,2,3,4,5,6])
print(type(pds))
pds

<class 'pandas.core.series.Series'>

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [3]:
#creating a pandas serires
pds_1 = pd.Series([1,2,3,4,5,6,np.nan])
pds_1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    NaN
dtype: float64

In [4]:
#retriving the index of the serires,
print(pds_1.index)

#iloc used to select an element based on its location
print("2nd Index Location using iloc ",pds_1.iloc[2])

#alternate option
print("2nd Index Location ",pds_1[2])

#shape of the series
print("Shape of the series ",pds_1.shape)

#size of the series
print("Size of the series ",pds_1.size)

print("printing first 3 elements of pds_1")
pds_1[0:3]

RangeIndex(start=0, stop=7, step=1)
2nd Index Location using iloc  3.0
2nd Index Location  3.0
Shape of the series  (7,)
Size of the series  7
printing first 3 elements of pds_1

0    1.0
1    2.0
2    3.0
dtype: float64

#### Date Range

In [5]:
pd_dates_0 = pd.date_range('20200620',periods=15) 
pd_dates_0

DatetimeIndex(['2020-06-20', '2020-06-21', '2020-06-22', '2020-06-23',
               '2020-06-24', '2020-06-25', '2020-06-26', '2020-06-27',
               '2020-06-28', '2020-06-29', '2020-06-30', '2020-07-01',
               '2020-07-02', '2020-07-03', '2020-07-04'],
              dtype='datetime64[ns]', freq='D')

In [6]:
#creating a datarange, here the starting date is given and how many sequence more is required. (periods=7)
pd_dates = pd.date_range('20200617',periods=15, freq='W-MON') 
pd_dates

DatetimeIndex(['2020-06-22', '2020-06-29', '2020-07-06', '2020-07-13',
               '2020-07-20', '2020-07-27', '2020-08-03', '2020-08-10',
               '2020-08-17', '2020-08-24', '2020-08-31', '2020-09-07',
               '2020-09-14', '2020-09-21', '2020-09-28'],
              dtype='datetime64[ns]', freq='W-MON')

More about this command and its optional functions <br>
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.date_range.html <br>
https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#timeseries-offset-aliases

In [7]:
df1 =pd.DataFrame(np.random.randn(15,4),index=pd_dates,columns=["A","B","C","D"])
df2 =pd.DataFrame(np.random.randint(1,45,size=(15,4)),index=pd_dates,columns=["A","B","C","D"])

print(df1)
print("\n")
print(df2)

                   A         B         C         D
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532
2020-06-29 -0.420582  0.741633 -0.756370  0.106287
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852
2020-07-13 -0.595989  0.139909 -0.482444  2.859109
2020-07-20  0.175092  1.012314  0.596162 -1.055022
2020-07-27  1.511802  2.020358  1.530308  0.444246
2020-08-03  0.596877 -0.992131 -1.249192  3.143723
2020-08-10 -1.093335 -0.677105 -0.871795  2.228093
2020-08-17 -0.051408  0.246546 -0.806788 -0.145559
2020-08-24 -0.542362  0.752074 -1.636775  2.244594
2020-08-31 -2.114157 -0.467934  0.430248  1.489414
2020-09-07 -0.896417 -0.139714 -1.277480  0.771571
2020-09-14  1.811374 -0.438155  1.611397 -0.894256
2020-09-21  0.712533 -2.328082 -2.186239 -0.530192
2020-09-28 -0.030950 -1.239450  0.331366 -0.591177


             A   B   C   D
2020-06-22   1   9  11  32
2020-06-29  23  18  35   9
2020-07-06  22   6  39  17
2020-07-13   6  31   7  17
2020-07-20  23  42   7  11
2020-07-27  30  43  17  17
2020-08-03  34  41  23  17
2020-08-10  29   6  32  23
2020-08-17  30  18   7  15
2020-08-24  33  34   6  32
2020-08-31  16  22  39  26
2020-09-07  15  28  29  34
2020-09-14  22  29  31   3
2020-09-21  36  24  38  22
2020-09-28  11  42  29   9

In [8]:
#Creating a data frame from a dictionary
df3 = pd.DataFrame({ 'A' : [1,2,3,4],
                      'B' : pd.Timestamp('20200618'),
                      'C' : pd.Series(1,index=list(range(4)),dtype="float32"),
                      'D' : np.array([5]*4,dtype='int32'),
                      'E' : pd.Categorical(['True','False','True','True']),
                      'F' : 'Pandas'})

df3

   A          B    C  D      E       F
0  1 2020-06-18  1.0  5   True  Pandas
1  2 2020-06-18  1.0  5  False  Pandas
2  3 2020-06-18  1.0  5   True  Pandas
3  4 2020-06-18  1.0  5   True  Pandas

In [9]:
#Understanding the datatypes of columns in the dataframe
df3.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
#converting a dataframe to a numpy array
df3.to_numpy()

array([[1, Timestamp('2020-06-18 00:00:00'), 1.0, 5, 'True', 'Pandas'],
       [2, Timestamp('2020-06-18 00:00:00'), 1.0, 5, 'False', 'Pandas'],
       [3, Timestamp('2020-06-18 00:00:00'), 1.0, 5, 'True', 'Pandas'],
       [4, Timestamp('2020-06-18 00:00:00'), 1.0, 5, 'True', 'Pandas']],
      dtype=object)

In [11]:
#printing first 3 elements of the dataframe. if no value specified, it'll take the default value of 5
df1.head(3)

                   A         B         C         D
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532
2020-06-29 -0.420582  0.741633 -0.756370  0.106287
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852

In [12]:
#peinitng the last 5 rows of the data frame
df1.tail()

                   A         B         C         D
2020-08-31 -2.114157 -0.467934  0.430248  1.489414
2020-09-07 -0.896417 -0.139714 -1.277480  0.771571
2020-09-14  1.811374 -0.438155  1.611397 -0.894256
2020-09-21  0.712533 -2.328082 -2.186239 -0.530192
2020-09-28 -0.030950 -1.239450  0.331366 -0.591177

In [13]:
#printing the index values of the data frame.
df1.index

DatetimeIndex(['2020-06-22', '2020-06-29', '2020-07-06', '2020-07-13',
               '2020-07-20', '2020-07-27', '2020-08-03', '2020-08-10',
               '2020-08-17', '2020-08-24', '2020-08-31', '2020-09-07',
               '2020-09-14', '2020-09-21', '2020-09-28'],
              dtype='datetime64[ns]', freq='W-MON')

In [14]:
#Prints column names
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
##general info about the dataframe
df1.describe()

               A          B          C          D
count  15.000000  15.000000  15.000000  15.000000
mean   -0.168756  -0.195796  -0.401352   0.655501
std     1.038231   1.063415   1.100799   1.407520
min    -2.114157  -2.328082  -2.186239  -1.055022
25%    -0.746203  -0.806847  -1.070345  -0.560685
50%    -0.302790  -0.438155  -0.756370   0.383532
75%     0.385984   0.494090   0.380807   1.858753
max     1.811374   2.020358   1.611397   3.143723

In [16]:
#sorting the data frame, uncomment one and see the output.

#df1.sort_values('C',ascending=True)
#df1.sort_values('C',ascending=False)
#df1.sort_index(axis=0,ascending=False)  ### sorting on the basis of index.
df1.sort_index(axis=0,ascending=True).head()

                   A         B         C         D
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532
2020-06-29 -0.420582  0.741633 -0.756370  0.106287
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852
2020-07-13 -0.595989  0.139909 -0.482444  2.859109
2020-07-20  0.175092  1.012314  0.596162 -1.055022

In [17]:
#printing only the first column
df1['A'].head()

2020-06-22   -1.291020
2020-06-29   -0.420582
2020-07-06   -0.302790
2020-07-13   -0.595989
2020-07-20    0.175092
Freq: W-MON, Name: A, dtype: float64

In [18]:
#printing the first and the third column
df1[['A','C']].head()

                   A         C
2020-06-22 -1.291020 -0.891499
2020-06-29 -0.420582 -0.756370
2020-07-06 -0.302790 -0.361174
2020-07-13 -0.595989 -0.482444
2020-07-20  0.175092  0.596162

In [19]:
#printing the first to the third rows
df1[0:3]

                   A         B         C         D
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532
2020-06-29 -0.420582  0.741633 -0.756370  0.106287
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852

In [20]:
#loc function is used when we know col names
df1.loc[:,['A','C']].head()

                   A         C
2020-06-22 -1.291020 -0.891499
2020-06-29 -0.420582 -0.756370
2020-07-06 -0.302790 -0.361174
2020-07-13 -0.595989 -0.482444
2020-07-20  0.175092  0.596162

In [21]:
#iloc function used when we know the col numer postions
df1.iloc[0:7,0:3]

                   A         B         C
2020-06-22 -1.291020 -0.936589 -0.891499
2020-06-29 -0.420582  0.741633 -0.756370
2020-07-06 -0.302790 -0.630622 -0.361174
2020-07-13 -0.595989  0.139909 -0.482444
2020-07-20  0.175092  1.012314  0.596162
2020-07-27  1.511802  2.020358  1.530308
2020-08-03  0.596877 -0.992131 -1.249192

In [22]:
## the first function is printing the value for the rows which satisfies the conditions
print(df1['A'] > 1.2)

##this command uses the above argument as a filter
df1[df1['A'] > 0.8]

2020-06-22    False
2020-06-29    False
2020-07-06    False
2020-07-13    False
2020-07-20    False
2020-07-27     True
2020-08-03    False
2020-08-10    False
2020-08-17    False
2020-08-24    False
2020-08-31    False
2020-09-07    False
2020-09-14     True
2020-09-21    False
2020-09-28    False
Freq: W-MON, Name: A, dtype: bool

                   A         B         C         D
2020-07-27  1.511802  2.020358  1.530308  0.444246
2020-09-14  1.811374 -0.438155  1.611397 -0.894256

##### Handiling Missing Data

In [23]:
#printing first 3 values to see
df1.head(3)

                   A         B         C         D
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532
2020-06-29 -0.420582  0.741633 -0.756370  0.106287
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852

In [24]:
#viewing the index of the data frame df1
df1.index

DatetimeIndex(['2020-06-22', '2020-06-29', '2020-07-06', '2020-07-13',
               '2020-07-20', '2020-07-27', '2020-08-03', '2020-08-10',
               '2020-08-17', '2020-08-24', '2020-08-31', '2020-09-07',
               '2020-09-14', '2020-09-21', '2020-09-28'],
              dtype='datetime64[ns]', freq='W-MON')

In [25]:
#assigning the index values of df1 to D
d=df1.index

#creatning a dataframe df_4, there are two menthods mentioned belwo
df_4 = df1.reindex(index=d[0:4],columns=list(df1.columns)+['E'])  ## reindex similar to set subset

#alternate method below
#df_4 = df1.reindex(index=df1.index[0:4],columns=list(df1.columns)+['E'])

#printing the dataframe
df_4

                   A         B         C         D   E
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532 NaN
2020-06-29 -0.420582  0.741633 -0.756370  0.106287 NaN
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852 NaN
2020-07-13 -0.595989  0.139909 -0.482444  2.859109 NaN

In [26]:
#allocating values to the nan columns
df_4.iloc[0,4]=0.7
df_4.iloc[1,4]=1.6

#printing 
df_4

                   A         B         C         D    E
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532  0.7
2020-06-29 -0.420582  0.741633 -0.756370  0.106287  1.6
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852  NaN
2020-07-13 -0.595989  0.139909 -0.482444  2.859109  NaN

In [27]:
#checking for the presense of nan
df_4.isnull()

                A      B      C      D      E
2020-06-22  False  False  False  False  False
2020-06-29  False  False  False  False  False
2020-07-06  False  False  False  False   True
2020-07-13  False  False  False  False   True

In [28]:
#counting the number of nan column wise.
df_4.isnull().sum()

A    0
B    0
C    0
D    0
E    2
dtype: int64

In [29]:
#to remove the nulls
print(df_4.dropna()) 

#df_4 = df_4.dropna()  ##drop the null values and saves it to the same
#df_4.dropna(inplace=True)

df_4

                   A         B         C         D    E
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532  0.7
2020-06-29 -0.420582  0.741633 -0.756370  0.106287  1.6

                   A         B         C         D    E
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532  0.7
2020-06-29 -0.420582  0.741633 -0.756370  0.106287  1.6
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852  NaN
2020-07-13 -0.595989  0.139909 -0.482444  2.859109  NaN

In [30]:
#backup/copy of the dataframe
df4_copy = df_4.copy()

In [31]:
#replacing the actual value with nulls for an experiment
df4_copy.iloc[3,0]=np.nan
df4_copy

                   A         B         C         D    E
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532  0.7
2020-06-29 -0.420582  0.741633 -0.756370  0.106287  1.6
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852  NaN
2020-07-13       NaN  0.139909 -0.482444  2.859109  NaN

In [32]:
#checking for nulls
pd.isna(df4_copy)

                A      B      C      D      E
2020-06-22  False  False  False  False  False
2020-06-29  False  False  False  False  False
2020-07-06  False  False  False  False   True
2020-07-13   True  False  False  False   True

In [33]:
#replacing all null values 
df4_copy.fillna(value=2.0,inplace=True)
df4_copy

                   A         B         C         D    E
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532  0.7
2020-06-29 -0.420582  0.741633 -0.756370  0.106287  1.6
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852  2.0
2020-07-13  2.000000  0.139909 -0.482444  2.859109  2.0

In [34]:
#both these functions are same #df_4.isnull() or pd.isnull(df_4)
pd.isnull(df_4)

                A      B      C      D      E
2020-06-22  False  False  False  False  False
2020-06-29  False  False  False  False  False
2020-07-06  False  False  False  False   True
2020-07-13  False  False  False  False   True

In [35]:
#printing 
df_4

                   A         B         C         D    E
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532  0.7
2020-06-29 -0.420582  0.741633 -0.756370  0.106287  1.6
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852  NaN
2020-07-13 -0.595989  0.139909 -0.482444  2.859109  NaN

In [36]:
#replacing the missing values of column E with the average/mean 
df_4.loc[pd.isnull(df_4['E']),['E']] = df_4['E'].mean()
df_4

                   A         B         C         D     E
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532  0.70
2020-06-29 -0.420582  0.741633 -0.756370  0.106287  1.60
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852  1.15
2020-07-13 -0.595989  0.139909 -0.482444  2.859109  1.15

### Pandas Merging Operations
#### Concat and Join

In [37]:
#creating two small dataframe to concat
df_m1 = df2[0:5]
df_m2 = df2[6:10]
df_m3 = df2[11:16]

In [38]:
print(df_m1,"\n",df_m2,'\n',df_m3)

             A   B   C   D
2020-06-22   1   9  11  32
2020-06-29  23  18  35   9
2020-07-06  22   6  39  17
2020-07-13   6  31   7  17
2020-07-20  23  42   7  11
              A   B   C   D
2020-08-03  34  41  23  17
2020-08-10  29   6  32  23
2020-08-17  30  18   7  15
2020-08-24  33  34   6  32
              A   B   C   D
2020-09-07  15  28  29  34
2020-09-14  22  29  31   3
2020-09-21  36  24  38  22
2020-09-28  11  42  29   9

In [39]:
#concatination of two DataFrame
concat0 = pd.concat([df_m1,df_m2,df_m3])
concat0

             A   B   C   D
2020-06-22   1   9  11  32
2020-06-29  23  18  35   9
2020-07-06  22   6  39  17
2020-07-13   6  31   7  17
2020-07-20  23  42   7  11
2020-08-03  34  41  23  17
2020-08-10  29   6  32  23
2020-08-17  30  18   7  15
2020-08-24  33  34   6  32
2020-09-07  15  28  29  34
2020-09-14  22  29  31   3
2020-09-21  36  24  38  22
2020-09-28  11  42  29   9

In [40]:
concat1 =pd.concat([df_m1,df_m2,df_m3],keys=['m1','m2','m3'])
concat1

                A   B   C   D
m1 2020-06-22   1   9  11  32
   2020-06-29  23  18  35   9
   2020-07-06  22   6  39  17
   2020-07-13   6  31   7  17
   2020-07-20  23  42   7  11
m2 2020-08-03  34  41  23  17
   2020-08-10  29   6  32  23
   2020-08-17  30  18   7  15
   2020-08-24  33  34   6  32
m3 2020-09-07  15  28  29  34
   2020-09-14  22  29  31   3
   2020-09-21  36  24  38  22
   2020-09-28  11  42  29   9

In [41]:
concat1.loc['m3']

             A   B   C   D
2020-09-07  15  28  29  34
2020-09-14  22  29  31   3
2020-09-21  36  24  38  22
2020-09-28  11  42  29   9

In [42]:
#alternative method to merge data vertically
df_m3.append([df_m1,df_m2],sort=True)

             A   B   C   D
2020-09-07  15  28  29  34
2020-09-14  22  29  31   3
2020-09-21  36  24  38  22
2020-09-28  11  42  29   9
2020-06-22   1   9  11  32
2020-06-29  23  18  35   9
2020-07-06  22   6  39  17
2020-07-13   6  31   7  17
2020-07-20  23  42   7  11
2020-08-03  34  41  23  17
2020-08-10  29   6  32  23
2020-08-17  30  18   7  15
2020-08-24  33  34   6  32

In [43]:
#creating data frame

In [44]:
DF_M1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
'B': ['B0', 'B1', 'B2', 'B3'],
'C': ['C0', 'C1', 'C2', 'C3'],
'D': ['D0', 'D1', 'D2', 'D3']},
index=[0, 1, 2, 3])


DF_M2 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
'D': ['D2', 'D3', 'D6', 'D7'],
'F': ['F2', 'F3', 'F6', 'F7']},
index=[2, 3, 6, 7])


print(DF_M1,"\n",DF_M2)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
     B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [45]:
#horizontal concat
concat2 = pd.concat([DF_M1, DF_M2], axis=1, sort=False)
#concat2 = pd.concat([DF_M1, DF_M2], axis=1)
concat2

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [46]:
DF_M1.append(DF_M2)

C:\MyDataScience\Anaconda\lib\site-packages\pandas\core\frame.py:7123: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [47]:
DF_M1.append(DF_M2,ignore_index=True,sort=True)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

#### Join

In [48]:
Join_1= pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

Join_2 = pd.DataFrame({'key': ['K0', 'K1', 'K2','D1'],
'B': ['B0', 'B1', 'B2','D1']})

print(Join_1,"\n",Join_2)

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5
   key   B
0  K0  B0
1  K1  B1
2  K2  B2
3  D1  D1

In [49]:
#joining two tables. by default left join
Join_1.join(Join_2, lsuffix='_J1', rsuffix='_J2')

  key_J1   A key_J2    B
0     K0  A0     K0   B0
1     K1  A1     K1   B1
2     K2  A2     K2   B2
3     K3  A3     D1   D1
4     K4  A4    NaN  NaN
5     K5  A5    NaN  NaN

In [50]:
#Inner Join
Join_1.join(Join_2, lsuffix='_J1', rsuffix='_J2',how='inner')

  key_J1   A key_J2   B
0     K0  A0     K0  B0
1     K1  A1     K1  B1
2     K2  A2     K2  B2
3     K3  A3     D1  D1

In [51]:
#outer
Join_1.join(Join_2, lsuffix='_J1', rsuffix='_J2',how='outer')

  key_J1   A key_J2    B
0     K0  A0     K0   B0
1     K1  A1     K1   B1
2     K2  A2     K2   B2
3     K3  A3     D1   D1
4     K4  A4    NaN  NaN
5     K5  A5    NaN  NaN

In [52]:
#Right
Join_1.join(Join_2, lsuffix='_J1', rsuffix='_J2',how='right')

  key_J1   A key_J2   B
0     K0  A0     K0  B0
1     K1  A1     K1  B1
2     K2  A2     K2  B2
3     K3  A3     D1  D1

how{‘left’, ‘right’, ‘outer’, ‘inner’}, default ‘left’
How to handle the operation of the two objects.

left: use calling frame’s index (or column if on is specified)

right: use other’s index.

outer: form union of calling frame’s index (or column if on is specified) with other’s index, and sort it. lexicographically.

inner: form intersection of calling frame’s index (or column if on is specified) with other’s index, preserving the order of the calling’s one.

#### Merge

In [53]:
print(Join_1,"\n",Join_2)

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5
   key   B
0  K0  B0
1  K1  B1
2  K2  B2
3  D1  D1

In [54]:
pd.merge(Join_1,Join_2,on='key')

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2

#### Groupby

In [55]:
Animals = pd.DataFrame({'Animal': ['Falcon', 'Falcon','Parrot', 'Parrot','Tiger','Lepord','Fox'],
                        'Type' : ['Bird','Bird','Bird','Bird','Carnivore','Carnivore','Carnivore'],
                   'Max Speed': [380., 370., 24., 26.,60.0,75.0,40.0]})

In [56]:
Animals

   Animal       Type  Max Speed
0  Falcon       Bird      380.0
1  Falcon       Bird      370.0
2  Parrot       Bird       24.0
3  Parrot       Bird       26.0
4   Tiger  Carnivore       60.0
5  Lepord  Carnivore       75.0
6     Fox  Carnivore       40.0

In [57]:
print(Animals.groupby(['Animal']).mean())
print("\n")
Animals.groupby(['Type']).mean()

        Max Speed
Animal
Falcon      375.0
Fox          40.0
Lepord       75.0
Parrot       25.0
Tiger        60.0

            Max Speed
Type
Bird       200.000000
Carnivore   58.333333

In [58]:
Animals.groupby(['Type','Animal']).mean()

                  Max Speed
Type      Animal
Bird      Falcon      375.0
          Parrot       25.0
Carnivore Fox          40.0
          Lepord       75.0
          Tiger        60.0

In [59]:
Animals.stack()

0  Animal          Falcon
   Type              Bird
   Max Speed          380
1  Animal          Falcon
   Type              Bird
   Max Speed          370
2  Animal          Parrot
   Type              Bird
   Max Speed           24
3  Animal          Parrot
   Type              Bird
   Max Speed           26
4  Animal           Tiger
   Type         Carnivore
   Max Speed           60
5  Animal          Lepord
   Type         Carnivore
   Max Speed           75
6  Animal             Fox
   Type         Carnivore
   Max Speed           40
dtype: object

In [60]:
Animals

   Animal       Type  Max Speed
0  Falcon       Bird      380.0
1  Falcon       Bird      370.0
2  Parrot       Bird       24.0
3  Parrot       Bird       26.0
4   Tiger  Carnivore       60.0
5  Lepord  Carnivore       75.0
6     Fox  Carnivore       40.0

#### Pivot

In [61]:
Pivot = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two','two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
Pivot

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [62]:
Pivot.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [63]:
Pivot.pivot(index='foo', columns='bar', values=['baz','zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

#### Categorical

In [64]:
Categorical  = pd.DataFrame({"Marks": [45, 75, 80, 92,34],
                             "Grade":['Third Class','First Class','Distinction','Rank','Fail']})
Categorical

   Marks        Grade
0     45  Third Class
1     75  First Class
2     80  Distinction
3     92         Rank
4     34         Fail

In [65]:
Categorical.dtypes

Marks     int64
Grade    object
dtype: object

In [66]:
Categorical["Grade"] = Categorical["Grade"].astype('category')
Categorical.dtypes

Marks       int64
Grade    category
dtype: object

In [67]:
catageory = pd.DataFrame({'value': np.random.randint(0, 99, 12)})
print(catageory)
labels = ["{0} - {1}".format(i, i + 9) for i in range(0, 100, 10)]
print(labels)

    value
0       3
1      39
2      71
3      40
4      78
5      18
6      72
7      45
8       8
9       1
10     46
11     30
['0 - 9', '10 - 19', '20 - 29', '30 - 39', '40 - 49', '50 - 59', '60 - 69', '70 - 79', '80 - 89', '90 - 99']

In [68]:
catageory['group'] = pd.cut(catageory.value, range(0, 105, 10), right=False, labels=labels)
catageory

    value    group
0       3    0 - 9
1      39  30 - 39
2      71  70 - 79
3      40  40 - 49
4      78  70 - 79
5      18  10 - 19
6      72  70 - 79
7      45  40 - 49
8       8    0 - 9
9       1    0 - 9
10     46  40 - 49
11     30  30 - 39

CUT <br>
Use cut when you need to segment and sort data values into bins. This function is also useful for going from a continuous variable to a categorical variable. For example, cut could convert ages to groups of age ranges. Supports binning into an equal number of bins, or a pre-specified array of bins.

#### Reading and Writting to a file

#### Pls download the zip file https://github.com/dsreenat/sperloon from this location <br>
and keep file at the location (op of the next line of command) <br> file name  python_pandas_dataset.zip

In [69]:
#identifying the current working directory
os.getcwd()

'C:\\Users\\Darshan Sreenath\\Python_Learning\\Github\\002_Python_Packages'

In [70]:
df1.head()

                   A         B         C         D
2020-06-22 -1.291020 -0.936589 -0.891499  0.383532
2020-06-29 -0.420582  0.741633 -0.756370  0.106287
2020-07-06 -0.302790 -0.630622 -0.361174 -0.621852
2020-07-13 -0.595989  0.139909 -0.482444  2.859109
2020-07-20  0.175092  1.012314  0.596162 -1.055022

In [71]:
df1.to_csv("df1_export.csv")

In [72]:
read_file = pd.read_csv("sample_read.csv")
read_file

     Name  Age Location
0   Sanju   30   Kollam
1  Salman   30     Pune
2     Raj   24      TVM
3    Ravi   35      TVM

In [73]:
sample_excel = pd.read_excel('sample_excel.xlsx', index_col=0)

In [74]:
df1.to_excel("df1_export.xlsx")

##### for Rish
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html <br>
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html